ljgabc/rtthread/bsp/n32g003/library/n32g003_gpio.c
    /* PLOCKK write 0 */
    GPIOx->PLOCK = pin; 
    
    /* PLOCKK and PLOCKx write 1 */
    GPIOx->PLOCK = temp_value; 

    /* PLOCKK read 0 */
    temp_value = GPIOx->PLOCK;
    
    /* PLOCKK read 1 */
    temp_value = GPIOx->PLOCK;
}


/**
 *\*\name   GPIO_Pin_Remap_Set.
 *\*\fun    Pin remapping configuration.
 *\*\param  port_source :
 *\*\          - GPIOA_PORT_SOURCE
 *\*\          - GPIOB_PORT_SOURCE
  *\*\       Note: When selects the GPIOB, Only GPIO_PIN_SOURCE0 and GPIO_PIN_SOURCE1 are valid
 *\*\param  pin_source :
 *\*\          - GPIO_PIN_SOURCE0
 *\*\          - GPIO_PIN_SOURCE1
 *\*\          - GPIO_PIN_SOURCE2
 *\*\          - GPIO_PIN_SOURCE3
 *\*\          - GPIO_PIN_SOURCE4
 *\*\          - GPIO_PIN_SOURCE5
 *\*\          - GPIO_PIN_SOURCE6
 *\*\          - GPIO_PIN_SOURCE7
 *\*\          - GPIO_PIN_SOURCE8
 *\*\          - GPIO_PIN_SOURCE9
 *\*\          - GPIO_PIN_SOURCE10
 *\*\          - GPIO_PIN_SOURCE11
 *\*\          - GPIO_PIN_SOURCE12
 *\*\          - GPIO_PIN_SOURCE13
 *\*\          - GPIO_PIN_SOURCE14
 *\*\          - GPIO_PIN_SOURCE15
 *\*\param  alternate_function :
 *\*\          - GPIO_AF0_SWDIO        SWDIO Alternate Function mapping   
 *\*\          - GPIO_AF0_SWCLK        SWCLK Alternate Function mapping   
 *\*\          - GPIO_AF0_TIM1         TIM1  Alternate Function mapping   
 *\*\          - GPIO_AF0_TIM3         TIM3  Alternate Function mapping   
 *\*\          - GPIO_AF0_SPI          SPI   Alternate Function mapping   
 *\*\
 *\*\          - GPIO_AF1_UART2        UART2 Alternate Function mapping    
 *\*\          - GPIO_AF1_TIM3         TIM3  Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF2_UART1        UART1 Alternate Function mapping    
 *\*\          - GPIO_AF2_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF2_TIM3         TIM3 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF3_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF3_COMP         COMP Alternate Function mapping    
 *\*\          - GPIO_AF3_EVENTOUT     EVENTOUT Alternate Function mapping     
 *\*\
 *\*\          - GPIO_AF4_TIM1         TIM1 Alternate Function mapping
 *\*\
 *\*\          - GPIO_AF5_UART1        UART1 Alternate Function mapping  
 *\*\          - GPIO_AF5_TIM1         TIM1 Alternate Function mapping  
 *\*\          - GPIO_AF5_SPI          SPI Alternate Function mapping      
 *\*\
 *\*\          - GPIO_AF6_SPI          SPI Alternate Function mapping    
 *\*\          - GPIO_AF6_I2C          I2C Alternate Function mapping    
 *\*\          - GPIO_AF6_TIM3         TIM3 Alternate Function mapping    
 *\*\          - GPIO_AF6_UART2        UART2 Alternate Function mapping    
 *\*\          - GPIO_AF6_MCO          MCO Alternate Function mapping        
 *\*\
 *\*\          - GPIO_AF7_BEEPER       BEEPER Alternate Function mapping         
 *\*\return none
 */
void GPIO_Pin_Remap_Set(uint8_t port_source, uint8_t pin_source, uint32_t alternate_function)
{
    uint32_t position = 0x00, temp_value = 0x00;
    GPIO_Module *GPIOx;

    /* Get Peripheral index */
    GPIOx = GPIO_GET_PERIPH(port_source);

    if(pin_source & (uint8_t)AF_SELECTION_MASK)
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

        /* Read GPIO_AFH register */
        temp_value = GPIOx->AFH;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4));

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFH register */
        GPIOx->AFH = temp_value;
    }
    else
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

        /* Read GPIO_AFL register */
        temp_value  = GPIOx->AFL;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4)); 

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFL register */
        GPIOx->AFL = temp_value;
    }
}

/**
 *\*\name   AFIO_ADC_External_Trigger_Set
 *\*\fun    Selects the GPIO pin used as EXTI Line.
 *\*\param  line_source:
 *\*\          - AFIO_ADC_TRIG_PA0
 *\*\          - AFIO_ADC_TRIG_PA1
 *\*\          - AFIO_ADC_TRIG_PA2
 *\*\          - AFIO_ADC_TRIG_PA3
 *\*\          - AFIO_ADC_TRIG_PA4
 *\*\          - AFIO_ADC_TRIG_PA5
 *\*\          - AFIO_ADC_TRIG_PA6
 *\*\          - AFIO_ADC_TRIG_PA7
 *\*\          - AFIO_ADC_TRIG_PA8
 *\*\          - AFIO_ADC_TRIG_PA9
 *\*\          - AFIO_ADC_TRIG_PA10
 *\*\          - AFIO_ADC_TRIG_PA11
 *\*\          - AFIO_ADC_TRIG_PA12
 *\*\          - AFIO_ADC_TRIG_PA13
 *\*\          - AFIO_ADC_TRIG_PA14
 *\*\          - AFIO_ADC_TRIG_PA15
 *\*\          - AFIO_ADC_TRIG_PB0
 *\*\          - AFIO_ADC_TRIG_PB1
 *\*\          Note: Each EXTI line corresponds to a separate pin in this series.
 *\*\return none
 */
void AFIO_ADC_External_Trigger_Set(uint8_t ADC_trigger)
{
	uint32_t temp_value = 0x00;
	
	temp_value = AFIO->CFG;
	temp_value &= ~AFIO_CFG_MASK;
	temp_value |= ADC_trigger;
	AFIO->CFG = temp_value;
}


/**
 *\*\name   AFIO_SPI_NSS_Mode_Set.
 *\*\fun    Selects NSS mode of SPI when idle.
 *\*\param  SPI_nss_mode : 
 *\*\          specifies the SPI_NSS mode to be configured.
 *\*\          - AFIO_SPI_NSS_HIGH_IMPEDANCE
 *\*\          - AFIO_SPI_NSS_High_LEVEL
 *\*\return none
 */
void AFIO_SPI_NSS_Mode_Set(uint32_t SPI_NSS_mode)
{
    uint32_t temp_value = 0x00U;

    temp_value = (AFIO->CFG & (~AFIO_CFG_SPI_NSS));

    if(SPI_NSS_mode != AFIO_SPI_NSS_HIGH_IMPEDANCE)
    {
        temp_value |= AFIO_SPI_NSS;
    }
    else
    {
        temp_value &= ~AFIO_SPI_NSS;
    }

    AFIO->CFG = temp_value;
}


/**
 *\*\name   AFIO_TIM3CH2_Remap.
 *\*\fun    Controls the TIM3_CH2 internal mapping.
 *\*\param  TIM3CH2_remap : 
 *\*\          specifies the TIM3_CH2 internal mapping.
 *\*\          - TIM3CH2_TO_PORT
 *\*\          - TIM3CH2_TO_LSI
 *\*\return none
 */
void AFIO_TIM3CH2_Remap(uint32_t TIM3CH2_remap)
{
    uint32_t temp_value = 0x00U;

    temp_value = (AFIO->CFG & (~AFIO_CFG_TIM3CH2_MAP));

    if(TIM3CH2_remap != TIM3CH2_TO_PORT)
    {
        temp_value |= AFIO_TIM3CH2_MAP;
    }
    else
    {
        temp_value &= ~AFIO_TIM3CH2_MAP;
    }

    AFIO->CFG = temp_value;
}





